# TODO 定义一个叫做“combination”的函数，设置1个参数 n，用于接收总金额。
# TODO 这个函数用于格式化输出总金额的"最优组合":现有1元，5元，10元，20元，50元，100元纸币不限，优先使用面值大的货币。
def combination(n): 
    b100 = n                                                       // 100
    b50  = (n - b100 * 100)                                        // 50
    b20  = (n - b100 * 100 - b50 * 50)                             // 20
    b10  = (n - b100 * 100 - b50 * 50 - b20 * 20)                  // 10
    b5   = (n - b100 * 100 - b50 * 50 - b20 * 20 -b10 * 10)        // 5
    b1   = n - b100 * 100 - b50 * 50 - b20 * 20 -b10 * 10 - b5 *5
    print(f"百元{b100}张，五十元{b50}张，二十元{b20}张，十元{b10}张，五元{b5}张，一元{b1}张")
combination(186)
combination(487)