# TODO 使用import导入numpy，并使用"np"作为该模块的简写
import numpy as np

# 第一大题学生分数
scoreOne = [16, 16, 18, 16, 20, 18, 14, 16, 8, 18, 14, 18, 20, 10, 16, 20, 16, 18, 20, 16, 20, 20, 18, 18, 16, 14, 16, 10, 12, 16, 10, 16, 16, 18, 20, 16, 20, 18, 18, 18, 14, 16, 20, 20, 18, 6, 20, 18, 20, 12, 20, 12, 20, 14, 14, 18, 18, 12, 18, 16, 20, 20, 18, 20, 20, 16, 18, 18, 14, 12, 16, 16]
# 第二大题学生分数
scoreTwo = [50, 45, 45, 45, 50, 40, 30, 50, 20, 25, 35, 40, 50, 25, 40, 50, 35, 45, 50, 40, 50, 50, 45, 35, 35, 45, 45, 25, 40, 35, 40, 45, 40, 40, 50, 40, 50, 45, 50, 35, 40, 50, 50, 50, 40, 25, 50, 25, 50, 25, 50, 35, 30, 30, 45, 50, 30, 40, 45, 40, 50, 50, 30, 50, 45, 40, 45, 45, 45, 35, 45, 40]

# TODO 使用np.array()函数创建scoreOne对应的一维数组，并赋值给变量scoreOneArr
scoreOneArr = np.array(scoreOne)
# TODO 使用np.array()函数创建scoreTwo对应的一维数组，并赋值给变量scoreTwoArr
scoreTwoArr = np.array(scoreTwo)

# TODO 按照题目要求，使用合适的数组运算计算出每位同学的分数
# 将运算结果赋值给变量sumArr
sumArr = (scoreOneArr + scoreTwoArr)/80 * 100
# TODO 使用print()输出变量sumArr
print(sumArr)